In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["rohan","seema","mahesh","shruti"],
    "marks":[9,55,67,98],
    "city":["Delhi","Jaipur","Rampur","Barilly"]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks     city
0   rohan      9    Delhi
1   seema     55   Jaipur
2  mahesh     67   Rampur
3  shruti     98  Barilly

In [5]:
df.index=[1,2,3,4]

In [6]:
df

     name  marks     city
1   rohan      9    Delhi
2   seema     55   Jaipur
3  mahesh     67   Rampur
4  shruti     98  Barilly

In [7]:
ser=pd.Series(np.random.rand(20))

In [8]:
ser

0     0.772911
1     0.890818
2     0.580397
3     0.734954
4     0.953274
5     0.774648
6     0.149224
7     0.418612
8     0.478140
9     0.883893
10    0.385412
11    0.816109
12    0.919884
13    0.051194
14    0.666097
15    0.426745
16    0.315879
17    0.311334
18    0.974190
19    0.769254
dtype: float64

In [9]:
type(ser)

pandas.Series

In [10]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [11]:
newdf

            0         1         2         3         4
0    0.738619  0.570710  0.505047  0.580453  0.601871
1    0.273160  0.778709  0.250019  0.535305  0.397421
2    0.237345  0.022715  0.414769  0.900542  0.790258
3    0.421481  0.890950  0.905730  0.925901  0.965505
4    0.283351  0.893673  0.652304  0.979921  0.074962
..        ...       ...       ...       ...       ...
329  0.845535  0.635670  0.341748  0.149922  0.064297
330  0.825227  0.009351  0.022401  0.081456  0.070993
331  0.631518  0.592967  0.476001  0.834439  0.847592
332  0.462951  0.895242  0.788692  0.240579  0.223054
333  0.939122  0.952226  0.497032  0.637094  0.733214

[334 rows x 5 columns]

In [12]:
newdf.head(3)

          0         1         2         3         4
0  0.738619  0.570710  0.505047  0.580453  0.601871
1  0.273160  0.778709  0.250019  0.535305  0.397421
2  0.237345  0.022715  0.414769  0.900542  0.790258

In [13]:
newdf.tail(3)

            0         1         2         3         4
331  0.631518  0.592967  0.476001  0.834439  0.847592
332  0.462951  0.895242  0.788692  0.240579  0.223054
333  0.939122  0.952226  0.497032  0.637094  0.733214

In [14]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.738619  0.570710  0.505047  0.580453  0.601871
1    0.273160  0.778709  0.250019  0.535305  0.397421
2    0.237345  0.022715  0.414769  0.900542  0.790258
3    0.421481  0.890950  0.905730  0.925901  0.965505
4    0.283351  0.893673  0.652304  0.979921  0.074962
..        ...       ...       ...       ...       ...
329  0.845535  0.635670  0.341748  0.149922  0.064297
330  0.825227  0.009351  0.022401  0.081456  0.070993
331  0.631518  0.592967  0.476001  0.834439  0.847592
332  0.462951  0.895242  0.788692  0.240579  0.223054
333  0.939122  0.952226  0.497032  0.637094  0.733214

[334 rows x 5 columns]

In [17]:
newdf.tail(3)

            0         1         2         3         4
331  0.631518  0.592967  0.476001  0.834439  0.847592
332  0.462951  0.895242  0.788692  0.240579  0.223054
333  0.939122  0.952226  0.497032  0.637094  0.733214

In [18]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.738619  0.570710  0.505047  0.580453  0.601871
1    0.273160  0.778709  0.250019  0.535305  0.397421
2    0.237345  0.022715  0.414769  0.900542  0.790258
3    0.421481  0.890950  0.905730  0.925901  0.965505
4    0.283351  0.893673  0.652304  0.979921  0.074962
..        ...       ...       ...       ...       ...
329  0.845535  0.635670  0.341748  0.149922  0.064297
330  0.825227  0.009351  0.022401  0.081456  0.070993
331  0.631518  0.592967  0.476001  0.834439  0.847592
332  0.462951  0.895242  0.788692  0.240579  0.223054
333  0.939122  0.952226  0.497032  0.637094  0.733214

[334 rows x 5 columns]

In [19]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.570710  0.505047  0.580453  0.601871
1    0.778709  0.250019  0.535305  0.397421
2    0.022715  0.414769  0.900542  0.790258
3    0.890950  0.905730  0.925901  0.965505
4    0.893673  0.652304  0.979921  0.074962
..        ...       ...       ...       ...
329  0.635670  0.341748  0.149922  0.064297
330  0.009351  0.022401  0.081456  0.070993
331  0.592967  0.476001  0.834439  0.847592
332  0.895242  0.788692  0.240579  0.223054
333  0.952226  0.497032  0.637094  0.733214

[334 rows x 4 columns]

In [20]:
newdf.dropna(inplace=True)